using System;
using System.Collections;
using System.Collections.Generic;
using System.Linq;
using System.Threading.Tasks;

namespace api.Helpers
{
    public static class ProductCategory
    {
        // тут нужно перейти на регекс в названиях потому что некоторые имеют формат 
        //||Часть категории|| ||Название|| ||часть категории||
        // обязательна сортировка от длинного к короткому
        public static List<string> CategoriesMilkSegment = new List<string>
        {
            @" *?простокваша*? ",
            @" *?творожная*? ",
            @" *?коктейль*? ",
            @" *?маргарин*? ",
            @" *?пирожное*? ",
            @" *?майонез*? ",
            @" *?сметана*? ",
            @" *?напиток*? ",
            @" *?творог*? ",
            @" *?сливки*? ",
            @" *?пудинг*? ",
            @" *?йогурт*? ",
            @" *?десерт*? ",
            @" *?кефир*? ",
            @" *?сырок*? ",
            @" *?масло*? ",
            @" *?суфле*? ",
            @" *?сгущенка",
            @" *?моло.*? ",
            @" *?крем*? ",
            @" *?желе*? ",
            @" *?сыр*? ",
            @" *?яйц.*? "
        };

        public static List<string> SubCategoryMilk = new List<string>
        {
            @"сливочное",
            @"провансаль",
            @"питьевые стерилизованные",
            @"обезжиренный",
            @"сметанный",
            @"оливковый",
            @"растительный",
            @"питьевой",
            @"кислосливочное",
            @"безлактозное",
            @"зерненый"


        };
    }
}