using System;
using System.Collections;
using System.Collections.Generic;
using System.Linq;
using System.Threading.Tasks;

namespace api.Helpers
{
    public static class ProductCategory
    {
        // тут нужно перейти на регекс в названиях потому что некоторые имеют формат 
        //||Часть категории|| ||Название|| ||часть категории||
        public static List<string> Categories = new List<string>
        {
            @"творог",
            @"масло.{1,30}сливочное",
            @"сгущенка",
            @"сливки",
            @"пудинг",
            @"масло.{1,30}сладко.?сливочное",
            @"масло.{1,30}топленое",
            @"напиток.{1,30}растительный",
            @"крем.{1,30}взбитый",
            @"желе",
            @"яйц.",
            @"сыр",
            @"молоко.{1,30}сгущ.ное",
            @"молочный.{1,30}напиток",
            @"напиток.{1,30}молочный",
            @"майонез",
            @"сметана",
            @"молоко",
            @"напиток",
            @"смесь",
            @"йогурт.{1,30}питьевой",
            @"коктейль.{1,30}молочный",
            @"молочный.{1,30}коктейль",
            @"десерт",
            @"суфле",
            @"творожная.{1,30}масса",
            @"маргарин",
            @"пирожное",
            @"Биотворог",

        };
    }
}