using System;
using System.Collections;
using System.Collections.Generic;
using System.Linq;
using System.Threading.Tasks;

namespace api.Helpers
{
    public static class ProductCategory
    {
        //  тут есть жопа что одно и то же могут назвать по разному как будто нужен словарь
        // [TODO] Как то понимать че делать с такми форматами ||Часть категории|| ||Название|| ||часть категории||
        // обязательна сортировка от длинного к короткому
        public static string MilkAndEggs = "Молочные продукты";

        public static string Backery = "Выпечка";

        public static List<string> SubCategoryMilk = new List<string>
        {
            @" *?простокваша*? ",
            @" *?творожная*? ",
            @" *?коктейль*? ",
            @" *?маргарин*? ",
            @" *?пирожное*? ",
            @" *?майонез*? ",
            @" *?ряженка*? ",
            @" *?творожок*? ",
            @" *?сметана*? ",
            @" *?напиток*? ",
            @" *?творог*? ",
            @" *?сливки*? ",
            @" *?пудинг*? ",
            @" *?йогурт*? ",
            @" *?десерт*? ",
            @" *?кефир*? ",
            @" *?сырок*? ",
            @" *?масло*? ",
            @" *?суфле*? ",
            @" *?сгущенка",
            @" *?моло.*? ",
            @" *?крем*? ",
            @" *?желе*? ",
            @" *?сыр*? ",
            @" *?яйц.*? "
        };

        public static List<string> SubCategoryBackery = new List<string>
        {
             @"лаваш",
             @"пицца",
             @"маффин",
             @"кулич",
             @"баранки",
             @"хлебцы",
             @"пирожок",
             @"хот-дог",
             @"донат",
             @"пирог",
             @"френч-дог",
             @"соломка",
             @"круассан",
             @"булочка",
             @"слойка",
             @"ватрушка",
             @"сухарики",
             @"плюшка",
             @"улитка",
             @"кулебяка",
             @"сушки",
             @"лепешки",
             @"кекс",
             @"хлеб"

        };
    }

}